In [45]:
import pandas as pd
import numpy as np
from statsmodels.tsa.arima_model import ARIMA
import pmdarima as pm
import matplotlib.pyplot as plt
from statsmodels.graphics.tsaplots import plot_acf, plot_pacf
from sklearn.metrics import mean_squared_error
from math import sqrt
from statsmodels.tsa.stattools import acf
plt.rcParams.update({'figure.figsize':(9,3), 'figure.dpi':120})
pd.options.mode.chained_assignment = None

In [46]:
dataset=pd.read_excel('DataSet2.xls')

In [47]:
dataset.head()

  "Month","Sunspots"
0     "1749-01",58.0
1     "1749-02",62.6
2     "1749-03",70.0
3     "1749-04",55.7
4     "1749-05",85.0

In [48]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2819 entries, 0 to 2818
Data columns (total 1 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   "Month","Sunspots"  2819 non-null   object
dtypes: object(1)
memory usage: 22.1+ KB

In [49]:
dataset.dropna(inplace=True)

In [50]:
new = dataset['"Month","Sunspots"'].str.split(",", n = 1, expand = True)
new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2819 entries, 0 to 2818
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2819 non-null   object
 1   1       2819 non-null   object
dtypes: object(2)
memory usage: 66.1+ KB

In [51]:
new.head()

           0     1
0  "1749-01"  58.0
1  "1749-02"  62.6
2  "1749-03"  70.0
3  "1749-04"  55.7
4  "1749-05"  85.0

In [52]:
new[0]=new[0].str.replace('\"','')

In [53]:
new.head()

         0     1
0  1749-01  58.0
1  1749-02  62.6
2  1749-03  70.0
3  1749-04  55.7
4  1749-05  85.0

In [54]:
new = new.rename(columns = {0:"Date",1:"Sunspots"})

In [55]:
new

         Date Sunspots
0     1749-01     58.0
1     1749-02     62.6
2     1749-03     70.0
3     1749-04     55.7
4     1749-05     85.0
...       ...      ...
2814  1983-08     71.8
2815  1983-09     50.3
2816  1983-10     55.8
2817  1983-11     33.3
2818  1983-12     33.4

[2819 rows x 2 columns]

In [56]:
new[['Year','Month']] = new.Date.str.split("-",expand=True)
new.drop(['Date'], axis=1)
new=new[['Year','Month','Sunspots']]

In [57]:
new.head()

   Year Month Sunspots
0  1749    01     58.0
1  1749    02     62.6
2  1749    03     70.0
3  1749    04     55.7
4  1749    05     85.0

In [58]:
new['Year'] = pd.to_numeric(new['Year'])
new['Month'] = pd.to_numeric(new['Month'])

In [59]:
for i in range(len(new['Month'])):
    if new['Month'].loc[i]>12:
        print(i)
        i=i+1

7
489

In [60]:
new.loc[7]

Year           8
Month       1749
Sunspots    66.3
Name: 7, dtype: object

In [61]:
mounth=new.Year.loc[7]
Years=new.Month.loc[7]

In [62]:
new.Month.iloc[7]=mounth
new.Year.iloc[7]=Years

In [63]:
new.loc[7]

Year        1749
Month          8
Sunspots    66.3
Name: 7, dtype: object

In [64]:
new.loc[489]

Year        1789
Month         13
Sunspots    89.7
Name: 489, dtype: object

In [65]:
new=new.drop([489],axis=0)
new.dropna(inplace=True)

In [67]:
new.head(490)

       Year  Month Sunspots
0    1749.0    1.0     58.0
1    1749.0    2.0     62.6
2    1749.0    3.0     70.0
3    1749.0    4.0     55.7
4    1749.0    5.0     85.0
..      ...    ...      ...
485  1789.0    6.0    120.0
486  1789.0    7.0    117.0
487  1789.0    8.0    103.0
488  1789.0    9.0    112.0
490  1789.0   11.0    134.0

[490 rows x 3 columns]

In [68]:
new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2816 entries, 0 to 2818
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Year      2816 non-null   float64
 1   Month     2816 non-null   float64
 2   Sunspots  2816 non-null   object
dtypes: float64(2), object(1)
memory usage: 88.0+ KB

In [69]:
new['Year'] = pd.to_numeric(new['Year'])
new.Year = new.Year.astype(int)
new.Month = new.Month.astype(int)
new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2816 entries, 0 to 2818
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Year      2816 non-null   int32
 1   Month     2816 non-null   int32
 2   Sunspots  2816 non-null   object
dtypes: int32(2), object(1)
memory usage: 66.0+ KB

In [70]:
new.head()

   Year  Month Sunspots
0  1749      1     58.0
1  1749      2     62.6
2  1749      3     70.0
3  1749      4     55.7
4  1749      5     85.0

In [71]:
new['Date'] =  new['Month'].map(str) + '-' + new['Year'].map(str)
new.drop(['Year','Month'], axis=1,inplace=True)

In [73]:
new.head(1820)

     Sunspots     Date
0        58.0   1-1749
1        62.6   2-1749
2        70.0   3-1749
3        55.7   4-1749
4        85.0   5-1749
...       ...      ...
1817     12.1   6-1900
1818      8.3   7-1900
1819      4.3   8-1900
1820      8.3   9-1900
1821     12.9  10-1900

[1820 rows x 2 columns]

In [74]:
new['Sunspots'] = pd.to_numeric(new['Sunspots'])
new['Date']=pd.to_datetime(new['Date'],format='%m-%Y')

In [75]:
new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2816 entries, 0 to 2818
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sunspots  2815 non-null   float64
 1   Date      2816 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1)
memory usage: 66.0 KB

In [77]:
new.head()

   Sunspots       Date
0      58.0 1749-01-01
1      62.6 1749-02-01
2      70.0 1749-03-01
3      55.7 1749-04-01
4      85.0 1749-05-01

In [78]:
new=new[['Date','Sunspots']]

In [79]:
new.to_csv('datasets2_csv.csv', encoding='utf-8')

In [80]:
df = pd.read_csv('datasets2_csv.csv',names=['value'], header=0)

In [82]:
df.head(1820)

                 value
0    1749-01-01   58.0
1    1749-02-01   62.6
2    1749-03-01   70.0
3    1749-04-01   55.7
4    1749-05-01   85.0
...                ...
1817 1900-06-01   12.1
1818 1900-07-01    8.3
1819 1900-08-01    4.3
1820 1900-09-01    8.3
1821 1900-10-01   12.9

[1820 rows x 1 columns]

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 2816 entries, (0, '1749-01-01') to (2818, '1983-12-01')
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   2815 non-null   float64
dtypes: float64(1)
memory usage: 237.0+ KB

In [84]:
df.dropna(inplace=True)

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 2815 entries, (0, '1749-01-01') to (2818, '1983-12-01')
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   2815 non-null   float64
dtypes: float64(1)
memory usage: 237.0+ KB

In [86]:
train = df[:-30].value
test = df[-30:]

In [87]:
model = pm.auto_arima(train, start_p=1, start_q=1,
                      test='adf',       # use adftest to find optimal 'd'
                      max_p=3, max_q=3, # maximum p and q
                      m=1,              # frequency of series
                      d=None,           # let model determine 'd'
                      seasonal=False,   # No Seasonality
                      start_P=0, 
                      D=0, 
                      trace=True,
                      error_action='ignore',  
                      suppress_warnings=True, 
                      stepwise=True)

print(model.summary())

Performing stepwise search to minimize aic
 ARIMA(1,0,1)(0,0,0)[0]             : AIC=23284.961, Time=0.18 sec
 ARIMA(0,0,0)(0,0,0)[0]             : AIC=31274.131, Time=0.02 sec
 ARIMA(1,0,0)(0,0,0)[0]             : AIC=23665.892, Time=0.05 sec
 ARIMA(0,0,1)(0,0,0)[0]             : AIC=28531.043, Time=0.13 sec
 ARIMA(2,0,1)(0,0,0)[0]             : AIC=23249.833, Time=0.40 sec
 ARIMA(2,0,0)(0,0,0)[0]             : AIC=23424.133, Time=0.05 sec
 ARIMA(3,0,1)(0,0,0)[0]             : AIC=23247.889, Time=0.55 sec
 ARIMA(3,0,0)(0,0,0)[0]             : AIC=23317.728, Time=0.08 sec
 ARIMA(3,0,2)(0,0,0)[0]             : AIC=23162.408, Time=1.23 sec
 ARIMA(2,0,2)(0,0,0)[0]             : AIC=23249.109, Time=0.21 sec
 ARIMA(3,0,3)(0,0,0)[0]             : AIC=23249.983, Time=0.72 sec
 ARIMA(2,0,3)(0,0,0)[0]             : AIC=23249.201, Time=0.45 sec
 ARIMA(3,0,2)(0,0,0)[0] intercept   : AIC=23106.327, Time=2.60 sec
 ARIMA(2,0,2)(0,0,0)[0] intercept   : AIC=23235.155, Time=1.30 sec
 ARIMA(3,0,1)(0,0,0)[0] intercept   : AIC=23233.791, Time=1.26 sec
 ARIMA(3,0,3)(0,0,0)[0] intercept   : AIC=23235.798, Time=2.55 sec
 ARIMA(2,0,1)(0,0,0)[0] intercept   : AIC=23236.002, Time=1.13 sec
 ARIMA(2,0,3)(0,0,0)[0] intercept   : AIC=23235.420, Time=1.81 sec

Best model:  ARIMA(3,0,2)(0,0,0)[0] intercept
Total fit time: 14.740 seconds
                               SARIMAX Results
==============================================================================
Dep. Variable:                      y   No. Observations:                 2785
Model:               SARIMAX(3, 0, 2)   Log Likelihood              -11546.164
Date:                Fri, 27 Aug 2021   AIC                          23106.327
Time:                        02:15:06   BIC                          23147.851
Sample:                             0   HQIC                         23121.320
                               - 2785
Covariance Type:                  opg
==============================================================================
                 coef    std err          z      P>|z|      [0.025      0.975]
------------------------------------------------------------------------------
intercept      0.1010      0.016      6.368      0.000       0.070       0.132
ar.L1          2.3281      0.022    106.228      0.000       2.285       2.371
ar.L2         -1.6838      0.044    -38.628      0.000      -1.769      -1.598
ar.L3          0.3537      0.022     16.101      0.000       0.311       0.397
ma.L1         -1.7904      0.014   -126.291      0.000      -1.818      -1.763
ma.L2          0.8144      0.014     56.828      0.000       0.786       0.843
sigma2       233.4404      4.028     57.959      0.000     225.546     241.334
===================================================================================
Ljung-Box (L1) (Q):                   0.00   Jarque-Bera (JB):              1548.02
Prob(Q):                              0.98   Prob(JB):                         0.00
Heteroskedasticity (H):               1.31   Skew:                             0.66
Prob(H) (two-sided):                  0.00   Kurtosis:                         6.41
===================================================================================

Warnings:
[1] Covariance matrix calculated using the outer product of gradients (complex-step).